---
kind: property
id: P:Autodesk.Revit.DB.DGNImportOptions.IgnoreUnsupportedElementWarning
source: html/09d8665c-03e3-b4fd-d765-5bd346a6b9e1.htm
---
# Autodesk.Revit.DB.DGNImportOptions.IgnoreUnsupportedElementWarning Property

If true, ignore warning messages about unsupported elements in the DGN file.
 If false, the import process is aborted if imported dgn files have unsupported elements.

## Syntax (C#)
```csharp
public bool IgnoreUnsupportedElementWarning { get; set; }
```